glocklueng/032/LayerOne_2014/badge/code/stm32-prox/hw_config.c
/*******************************************************************************
* Function Name  : USB_Interrupts_Config.
* Description    : Configures the USB interrupts.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void USB_Interrupts_Config(void)
{
  NVIC_InitTypeDef NVIC_InitStructure;
 
  /* Set the Vector Table base address at 0x08000000 */
  NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x00);
  
  NVIC_InitStructure.NVIC_IRQChannel = USB_LP_CAN_RX0_IRQChannel;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
#if 0
  /* Enable the EXTI0 Interrupt(KEY) */
  NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQChannel;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  
  /* Enable the EXTI15_10 Interrupt(TAMP) */
  NVIC_InitStructure.NVIC_IRQChannel = EXTI15_10_IRQChannel;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  
    /* Enable the DMA1 Channel1 Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel1_IRQChannel;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
#endif
}

/*******************************************************************************
* Function Name  : USB_Cable_Config.
* Description    : Software Connection/Disconnection of USB Cable.
* Input          : NewState: new state.
* Output         : None.
* Return         : None
*******************************************************************************/
void USB_Cable_Config (FunctionalState NewState)
{ 

#ifdef USB_DISCONNECT_PORT
  if (NewState != DISABLE)
  {
    GPIO_SetBits(USB_DISCONNECT_PORT, USB_DISCONNECT_PIN);
  }
  else
  {
    GPIO_ResetBits(USB_DISCONNECT_PORT, USB_DISCONNECT_PIN);
  }
#endif
  
}

/*
	GPIO_Mode_AIN           ;Analog in
	GPIO_Mode_IN_FLOATING   ;input floating (save more power compare to IPD or IPU - use if appropriate)
	GPIO_Mode_IPD           ;input pulled down
	GPIO_Mode_IPU           ;input pulled up

*/

/*******************************************************************************
* Function Name  : GPIO_Configuration
* Description    : Configures the different GPIO ports.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void GPIO_Configuration(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  
  RCC_APB2PeriphClockCmd(
#ifdef RCC_APB2Periph_GPIO_DISCONNECT
					 RCC_APB2Periph_GPIO_DISCONNECT | 
#endif
					 RCC_APB2Periph_GPIOA | 
					 RCC_APB2Periph_GPIOB | 
					 RCC_APB2Periph_GPIOC | 
                     RCC_APB2Periph_GPIOD, 
                ENABLE);   


    
  // Disable JTRST , i want to use it for a USB D+ Pull Up (didn't work!)
  GPIO_PinRemapConfig(GPIO_Remap_SWJ_NoJTRST, ENABLE);
  
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  GPIO_WriteBit(GPIOB, GPIO_Pin_4  , Bit_RESET);
 
	/* Setup INPUTs */
  
#ifdef GPIOA_INPUT_FLOAT_MASK
  /* Configure GPIOA Inputs Floating */
  GPIO_InitStructure.GPIO_Pin = GPIOA_INPUT_FLOAT_MASK;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif
 
#ifdef GPIOB_INPUT_FLOAT_MASK
  /* Configure GPIOB Inputs Floating */
  GPIO_InitStructure.GPIO_Pin = GPIOB_INPUT_FLOAT_MASK;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
#endif
  
#ifdef GPIOC_INPUT_FLOAT_MASK
  /* Configure GPIOC Inputs Floating */
  GPIO_InitStructure.GPIO_Pin = GPIOC_INPUT_FLOAT_MASK;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
#endif

#ifdef GPIOD_INPUT_FLOAT_MASK
  /* Configure GPIOD Inputs Floating */
  GPIO_InitStructure.GPIO_Pin = GPIOD_INPUT_FLOAT_MASK;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
#endif
  
  
  /* Inputs that are pull downs */
  
#ifdef GPIOA_INPUT_PULLDOWN_MASK
  /* Configure GPIOA Inputs pulled down */
  GPIO_InitStructure.GPIO_Pin = GPIOA_INPUT_PULLDOWN_MASK;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif
 
#ifdef GPIOB_INPUT_PULLDOWN_MASK
  /* Configure GPIOB Inputs pulled down */
  GPIO_InitStructure.GPIO_Pin = GPIOB_INPUT_PULLDOWN_MASK;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
#endif
 
#ifdef GPIOC_INPUT_PULLDOWN_MASK
  /* Configure GPIOC Inputs pulled down */
  GPIO_InitStructure.GPIO_Pin = GPIOC_INPUT_PULLDOWN_MASK;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
#endif
 
#ifdef GPIOD_INPUT_PULLDOWN_MASK
  /* Configure GPIOD Inputs pulled down */
  GPIO_InitStructure.GPIO_Pin = GPIOD_INPUT_PULLDOWN_MASK;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
#endif
  
   /* Inputs that are pull ups */
  
#ifdef GPIOA_INPUT_PULLUP_MASK
  /* Configure GPIOA Inputs pulled UP */
  GPIO_InitStructure.GPIO_Pin = GPIOA_INPUT_PULLUP_MASK;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif
 
#ifdef GPIOB_INPUT_PULLUP_MASK
  /* Configure GPIOB Inputs pulled UP */
  GPIO_InitStructure.GPIO_Pin = GPIOB_INPUT_PULLUP_MASK;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
#endif
 
#ifdef GPIOC_INPUT_PULLUP_MASK
  /* Configure GPIOC Inputs pulled UP */
  GPIO_InitStructure.GPIO_Pin = GPIOC_INPUT_PULLUP_MASK;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
#endif
 
#ifdef GPIOD_INPUT_PULLUP_MASK
  /* Configure GPIOD Inputs pulled UP */
  GPIO_InitStructure.GPIO_Pin = GPIOD_INPUT_PULLUP_MASK;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
#endif
 
	
  /* End INPUTs */

	/* 50Mhz Outputs */
  
#ifdef GPIOA_OUTPUTS_50MHZ_PP_MASK
  /* Configure GPIOA Outputs (pp) 50Mhz*/
  GPIO_InitStructure.GPIO_Pin = GPIOA_OUTPUTS_50MHZ_PP_MASK;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif
  
#ifdef GPIOB_OUTPUTS_50MHZ_PP_MASK
  /* Configure GPIOB Outputs (pp) */
  GPIO_InitStructure.GPIO_Pin = GPIOB_OUTPUTS_50MHZ_PP_MASK;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
#endif  

#ifdef GPIOC_OUTPUTS_50MHZ_PP_MASK
  /* Configure GPIOC Outputs (pp) */
  GPIO_InitStructure.GPIO_Pin = GPIOC_OUTPUTS_50MHZ_PP_MASK;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
#endif
  
#ifdef GPIOD_OUTPUTS_50MHZ_PP_MASK
  /* Configure GPIOD Outputs (pp) 50MHZ*/
  GPIO_InitStructure.GPIO_Pin = GPIOD_OUTPUTS_50MHZ_PP_MASK;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
#endif

  
