glocklueng/032/LayerOne_2014/badge/code/stm32-prox/hw_config.c
#ifdef GPIOA_OUTPUTS_50MHZ_OD_MASK
  /* Configure GPIOA Outputs (OD) 50Mhz*/
  GPIO_InitStructure.GPIO_Pin = GPIOA_OUTPUTS_50MHZ_OD_MASK;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif
  
#ifdef GPIOB_OUTPUTS_50MHZ_OD_MASK
  /* Configure GPIOB Outputs (OD) */
  GPIO_InitStructure.GPIO_Pin = GPIOB_OUTPUTS_50MHZ_OD_MASK;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
#endif  

#ifdef GPIOC_OUTPUTS_50MHZ_OD_MASK
  /* Configure GPIOC Outputs (pp) */
  GPIO_InitStructure.GPIO_Pin = GPIOC_OUTPUTS_50MHZ_OD_MASK;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
#endif
  
#ifdef GPIOD_OUTPUTS_50MHZ_OD_MASK
  /* Configure GPIOD Outputs (OD) 50MHZ*/
  GPIO_InitStructure.GPIO_Pin = GPIOD_OUTPUTS_50MHZ_OD_MASK;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
#endif

  
 /* 10Mhz Outputs */
  
#ifdef GPIOA_OUTPUTS_10MHZ_PP_MASK
  /* Configure GPIOA Outputs (pp) 10Mhz*/
  GPIO_InitStructure.GPIO_Pin = GPIOA_OUTPUTS_10MHZ_PP_MASK;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif
  
#ifdef GPIOB_OUTPUTS_10MHZ_PP_MASK
  /* Configure GPIOB Outputs (pp) */
  GPIO_InitStructure.GPIO_Pin = GPIOB_OUTPUTS_10MHZ_PP_MASK;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
#endif  

#ifdef GPIOC_OUTPUTS_10MHZ_PP_MASK
  /* Configure GPIOC Outputs (pp) */
  GPIO_InitStructure.GPIO_Pin = GPIOC_OUTPUTS_10MHZ_PP_MASK;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
#endif
  
#ifdef GPIOD_OUTPUTS_10MHZ_PP_MASK
  /* Configure GPIOD Outputs (pp) 50MHZ*/
  GPIO_InitStructure.GPIO_Pin = GPIOD_OUTPUTS_10MHZ_PP_MASK;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
#endif
  
   
   /* 2MHZ Outputs */
  
#ifdef GPIOA_OUTPUTS_2MHZ_PP_MASK
  /* Configure GPIOA Outputs (pp) 2MHZ*/
  GPIO_InitStructure.GPIO_Pin = GPIOA_OUTPUTS_2MHZ_PP_MASK;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif
  
#ifdef GPIOB_OUTPUTS_2MHZ_PP_MASK
  /* Configure GPIOB Outputs (pp) */
  GPIO_InitStructure.GPIO_Pin = GPIOB_OUTPUTS_2MHZ_PP_MASK;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
#endif  

#ifdef GPIOC_OUTPUTS_2MHZ_PP_MASK
  /* Configure GPIOC Outputs (pp) */
  GPIO_InitStructure.GPIO_Pin = GPIOC_OUTPUTS_2MHZ_PP_MASK;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
#endif
  
#ifdef GPIOD_OUTPUTS_2MHZ_PP_MASK
  /* Configure GPIOD Outputs (pp) 50MHZ*/
  GPIO_InitStructure.GPIO_Pin = GPIOD_OUTPUTS_2MHZ_PP_MASK;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
#endif

  /* End OUTPUTS */
  
	/* Set OUTPUTs default state */
  
#ifdef GPIOA_DEFAULT_LOW_MASK
  GPIO_WriteBit(GPIOA, GPIOA_DEFAULT_LOW_MASK,Bit_RESET); 
#endif

#ifdef GPIOA_DEFAULT_HIGH_MASK
  GPIO_WriteBit(GPIOA, GPIOA_DEFAULT_HIGH_MASK,Bit_SET); 
#endif
 
#ifdef GPIOB_DEFAULT_LOW_MASK
  GPIO_WriteBit(GPIOB, GPIOB_DEFAULT_LOW_MASK,Bit_RESET); 
#endif

#ifdef GPIOB_DEFAULT_HIGH_MASK
  GPIO_WriteBit(GPIOB, GPIOB_DEFAULT_HIGH_MASK,Bit_SET); 
#endif

#ifdef GPIOC_DEFAULT_LOW_MASK
  GPIO_WriteBit(GPIOC, GPIOC_DEFAULT_LOW_MASK,Bit_RESET); 
#endif

#ifdef GPIOC_DEFAULT_HIGH_MASK
  GPIO_WriteBit(GPIOC, GPIOC_DEFAULT_HIGH_MASK,Bit_SET); 
#endif

#ifdef GPIOD_DEFAULT_LOW_MASK
  GPIO_WriteBit(GPIOD, GPIOD_DEFAULT_LOW_MASK,Bit_RESET); 
#endif

#ifdef GPIOD_DEFAULT_HIGH_MASK
  GPIO_WriteBit(GPIOD, GPIOD_DEFAULT_HIGH_MASK,Bit_SET); 
#endif

  /* End Default States */
  
  /* ANALOG Setup */
  
#ifdef GPIOA_ANALOG_MASK
  /* Configure GPIOA analog input -------------------------*/
  GPIO_InitStructure.GPIO_Pin = GPIOA_ANALOG_MASK;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif  

#ifdef GPIOB_ANALOG_MASK
  /* Configure GPIOB analog input -------------------------*/
  GPIO_InitStructure.GPIO_Pin = GPIOB_ANALOG_MASK;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
#endif  
  
#ifdef GPIOC_ANALOG_MASK
  /* Configure GPIOC analog input -------------------------*/
  GPIO_InitStructure.GPIO_Pin = GPIOC_ANALOG_MASK;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
#endif  
  
#ifdef GPIOD_ANALOG_MASK
  /* Configure GPIOD analog input -------------------------*/
  GPIO_InitStructure.GPIO_Pin = GPIOD_ANALOG_MASK;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
#endif  
  
 
 /* End ANALOG */
  
 
  // Setup Timer 24MHz
  
  GPIO_InitStructure.GPIO_Pin = PCK0_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  //GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  //GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  //GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_Init(PCK0_PORT, &GPIO_InitStructure);
  
  /* Connect TIM1 pins to AF */
//  GPIO_PinAFConfig(PCK0_PORT, GPIO_PinSource4, GPIO_AF_TIM1);
  
  
