glocklueng/032/LayerOne_2014/badge/code/stm32-prox/hw_config.c
#if 0
  
  
  /* Configure the FPGA NINIT  IO as Input Floating */
  GPIO_InitStructure.GPIO_Pin = ( FPGA_NINIT_PIN  );
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(FPGA_NINIT_PORT, &GPIO_InitStructure);
 
  /* Configure the FPGA  nprogram and nvdd IOs as Output PP */
  GPIO_InitStructure.GPIO_Pin = ( FPGA_NPROGRAM_PIN | NVDD_ON_PIN );
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(FPGAON_PORT, &GPIO_InitStructure);
  // turns off power to FPGA, and leaves it in reset mode
  GPIO_WriteBit(FPGAON_PORT,( FPGA_NPROGRAM_PIN | NVDD_ON_PIN ),Bit_RESET); 
  
  /* Configure the FPGA  DOUT and SSC IOs as Output PP */
  GPIO_InitStructure.GPIO_Pin = ( FPGA_DOUT_PIN );
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(FPGA_DOUT_PORT, &GPIO_InitStructure);
  GPIO_WriteBit(FPGA_DOUT_PORT,( FPGA_DOUT_PIN ),Bit_RESET); 

  /* Configure the FPGA DONE  IO as Input Floating */
  /* FPGA Done wil toggle in after the bistream is loaded */
  GPIO_InitStructure.GPIO_Pin = ( FPGA_DONE_PIN  );
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(FPGA_DONE_PORT, &GPIO_InitStructure);
  
  /* Configure AMPL_LO and AMPL_HI IO as analog input -------------------------*/
  GPIO_InitStructure.GPIO_Pin = ( AMPL_LO_PIN | AMPL_HI_PIN );
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(AMPL_PORT, &GPIO_InitStructure);

  /* Configure the LED IOs as Output PP */
  GPIO_InitStructure.GPIO_Pin = LED_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(LED_PORT, &GPIO_InitStructure);
  
  /* Configure the SPEAKER IOs as Output PP */
  GPIO_InitStructure.GPIO_Pin = SPEAKER_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(SPEAKER_PORT, &GPIO_InitStructure);
  GPIO_WriteBit(SPEAKER_PORT,SPEAKER_PIN,Bit_RESET); 
  
  /* Configure the RELAY IO as Output PP */  
  GPIO_InitStructure.GPIO_Pin = RELAY_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(RELAY_PORT, &GPIO_InitStructure);
  GPIO_WriteBit(RELAY_PORT,RELAY_PIN,Bit_RESET); 
  
  //OLED outputs, !RESET and !CS and D/C ( RS)
  GPIO_InitStructure.GPIO_Pin = RES_PIN |CS_PIN | DC_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(OLED_PORT, &GPIO_InitStructure);
  GPIO_WriteBit(OLED_PORT, RES_PIN|CS_PIN |DC_PIN,Bit_SET); 
 
  //OLED outputs, DB1/ DB0
  GPIO_InitStructure.GPIO_Pin = SDIN_DB1_PIN | SCLK_DB0_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(OLED2_PORT, &GPIO_InitStructure);
  GPIO_WriteBit(OLED2_PORT, ( SDIN_DB1_PIN | SCLK_DB0_PIN ) ,Bit_RESET);  

#endif
}



/*******************************************************************************
* Function Name : EXTI_Configuration.
* Description   : Configure the EXTI lines for Key and Tamper push buttons.
* Input         : None.
* Output        : None.
* Return value  : The direction value.
*******************************************************************************/
void EXTI_Configuration(void)
{
  EXTI_InitTypeDef EXTI_InitStructure;
   
  /* Enable the AFIO Clock */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);  
  
  /* Connect SW K1 to the correspondent EXTI line */
  GPIO_EXTILineConfig(GPIO_SW_PORTSOURCE, GPIO_SW_K1_PINSOURCE);
  
  /* Configure SW K1 EXTI line to generate an interrupt on rising & falling edges */  
  EXTI_InitStructure.EXTI_Line = GPIO_SW_K1_EXTI_Line;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);

  /* Clear the SW K1 EXTI line pending bit */
  EXTI_ClearITPendingBit(GPIO_SW_K1_EXTI_Line);
  
  
  /* Connect SW K2 button to the correspondent EXTI line */
  GPIO_EXTILineConfig(GPIO_SW_PORTSOURCE, GPIO_SW_K2_PINSOURCE);
  
  /* Configure SW K2 EXTI Line to generate an interrupt rising & falling edges */  
  EXTI_InitStructure.EXTI_Line = GPIO_SW_K2_EXTI_Line;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);

  /* Clear the SW K2 EXTI line pending bit */
  EXTI_ClearITPendingBit(GPIO_SW_K2_EXTI_Line);
  
}

/*******************************************************************************
* Function Name : ADC_Configuration.
* Description   : Configure the ADC and DMA.
* Input         : None.
* Output        : None.
* Return value  : The direction value.
*******************************************************************************/
void ADC_Configuration(void)
{
  ADC_InitTypeDef ADC_InitStructure;
  DMA_InitTypeDef DMA_InitStructure;

  /* Enable DMA1 clock */
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

  /* Enable ADC1 clock */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
  
  /* DMA1 channel1 configuration ---------------------------------------------*/
  DMA_DeInit(DMA1_Channel1);
  DMA_InitStructure.DMA_PeripheralBaseAddr = ADC1_DR_Address;
  DMA_InitStructure.DMA_MemoryBaseAddr = (u32)&ADC_Ampl[0];
  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
  DMA_InitStructure.DMA_BufferSize = 2;
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
  DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
  DMA_InitStructure.DMA_Priority = DMA_Priority_Low;
  DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
  DMA_Init(DMA1_Channel1, &DMA_InitStructure);
  
